stress-tests/results/autocannon-express-baseline.txt
Running 10s test @ http://localhost:3000/boards
10 connections


┌─────────┬──────┬───────┬───────┬───────┬──────────┬──────────┬────────┐
│ Stat    │ 2.5% │ 50%   │ 97.5% │ 99%   │ Avg      │ Stdev    │ Max    │
├─────────┼──────┼───────┼───────┼───────┼──────────┼──────────┼────────┤
│ Latency │ 6 ms │ 10 ms │ 23 ms │ 27 ms │ 11.47 ms │ 10.24 ms │ 285 ms │
└─────────┴──────┴───────┴───────┴───────┴──────────┴──────────┴────────┘
┌───────────┬────────┬────────┬────────┬────────┬────────┬─────────┬────────┐
│ Stat      │ 1%     │ 2.5%   │ 50%    │ 97.5%  │ Avg    │ Stdev   │ Min    │
├───────────┼────────┼────────┼────────┼────────┼────────┼─────────┼────────┤
│ Req/Sec   │ 519    │ 519    │ 847    │ 1,027  │ 834.8  │ 139.11  │ 519    │
├───────────┼────────┼────────┼────────┼────────┼────────┼─────────┼────────┤
│ Bytes/Sec │ 294 kB │ 294 kB │ 480 kB │ 583 kB │ 473 kB │ 78.9 kB │ 294 kB │
└───────────┴────────┴────────┴────────┴────────┴────────┴─────────┴────────┘

Req/Bytes counts sampled once per second.
# of samples: 10

8k requests in 10.03s, 4.73 MB read