stress-tests/results/autocannon-express-stress.txt
Running 30s test @ http://localhost:3000/boards
100 connections with 10 pipelining factor


┌─────────┬────────┬────────┬─────────┬─────────┬───────────┬──────────┬─────────┐
│ Stat    │ 2.5%   │ 50%    │ 97.5%   │ 99%     │ Avg       │ Stdev    │ Max     │
├─────────┼────────┼────────┼─────────┼─────────┼───────────┼──────────┼─────────┤
│ Latency │ 807 ms │ 930 ms │ 1141 ms │ 1155 ms │ 941.66 ms │ 97.75 ms │ 1215 ms │
└─────────┴────────┴────────┴─────────┴─────────┴───────────┴──────────┴─────────┘
┌───────────┬────────┬────────┬────────┬────────┬──────────┬────────┬────────┐
│ Stat      │ 1%     │ 2.5%   │ 50%    │ 97.5%  │ Avg      │ Stdev  │ Min    │
├───────────┼────────┼────────┼────────┼────────┼──────────┼────────┼────────┤
│ Req/Sec   │ 674    │ 674    │ 1,009  │ 1,355  │ 1,042.87 │ 141.02 │ 674    │
├───────────┼────────┼────────┼────────┼────────┼──────────┼────────┼────────┤
│ Bytes/Sec │ 382 kB │ 382 kB │ 572 kB │ 769 kB │ 591 kB   │ 80 kB  │ 382 kB │
└───────────┴────────┴────────┴────────┴────────┴──────────┴────────┴────────┘

Req/Bytes counts sampled once per second.
# of samples: 30

32k requests in 30.07s, 17.7 MB read