stress-tests/results/autocannon-fastify-stress.txt
Running 30s test @ http://localhost:4000/boards
100 connections with 10 pipelining factor


┌─────────┬────────┬─────────┬─────────┬─────────┬────────────┬───────────┬─────────┐
│ Stat    │ 2.5%   │ 50%     │ 97.5%   │ 99%     │ Avg        │ Stdev     │ Max     │
├─────────┼────────┼─────────┼─────────┼─────────┼────────────┼───────────┼─────────┤
│ Latency │ 925 ms │ 1030 ms │ 1356 ms │ 1438 ms │ 1048.62 ms │ 127.21 ms │ 1683 ms │
└─────────┴────────┴─────────┴─────────┴─────────┴────────────┴───────────┴─────────┘
┌───────────┬────────┬────────┬────────┬────────┬────────┬────────┬────────┐
│ Stat      │ 1%     │ 2.5%   │ 50%    │ 97.5%  │ Avg    │ Stdev  │ Min    │
├───────────┼────────┼────────┼────────┼────────┼────────┼────────┼────────┤
│ Req/Sec   │ 405    │ 405    │ 971    │ 1,058  │ 937.27 │ 125.88 │ 405    │
├───────────┼────────┼────────┼────────┼────────┼────────┼────────┼────────┤
│ Bytes/Sec │ 209 kB │ 209 kB │ 501 kB │ 546 kB │ 484 kB │ 65 kB  │ 209 kB │
└───────────┴────────┴────────┴────────┴────────┴────────┴────────┴────────┘

Req/Bytes counts sampled once per second.
# of samples: 30

29k requests in 30.15s, 14.5 MB read